      *ESTA DIVISION EL PROGRAMA LO INTERPRETA COMO COMENTARIO
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EDUC3003.
       AUTHOR. DIANA SALGUERO.

      *ESTA DIVISION  ES EL HEADER
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

      *ESTA DIVISION ES PARA DECLARAR VARIABLES
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WKS-REGISTRO.
          02 WKS-A             PIC 9(04)V99.
          02                   PIC X.
          02 WKS-B             PIC 9(04)V99.
          02                   PIC X.
          02 WKS-C             PIC 9(04)V99.
          02                   PIC X.
          02 WKS-D             PIC 9(04)V99.
          02                   PIC X.
          02 WKS-E             PIC 9(04)V99.
          02                   PIC X.

       01 WKS-REGISTRO-BACKUP  PIC X(34).

      *AQUI INICIA EL PROCESO DEL PROGRAMA PARA EVALUAR DATOS
       PROCEDURE DIVISION.
      *SECCION PRINCIPAL OPERACIONES
       00-OPERACIONES SECTION.
      *ACEPTANDO REGISTRO DEL SYSIN
           ACCEPT WKS-REGISTRO FROM SYSIN
      *PASANDO VALORES (TIPO OBJETO)
           MOVE WKS-REGISTRO TO WKS-REGISTRO-BACKUP
           DISPLAY "ANTES:" WKS-REGISTRO
           DISPLAY "OPERACION 1: SUMA-ADD A B 5 TO C GIVING D"
      *CALCULO 1 SUMA
           ADD WKS-A WKS-B 5 TO WKS-C GIVING WKS-D
           DISPLAY "DONDE, A ES:" WKS-A " B ES: " WKS-B " C ES: " WKS-C
           DISPLAY "Y EL RESULTADO ES: " WKS-D
           DISPLAY "DESPUES:" WKS-REGISTRO
           DISPLAY "   "

      *REGRESAR EL BACKUP Y REPETIR EL PROCESO PARA OPERACION 2
           MOVE WKS-REGISTRO-BACKUP TO WKS-REGISTRO
           DISPLAY "ANTES:" WKS-REGISTRO
           DISPLAY "OPERACION 2:RESTA- SUBTRACT C FROM A B"
      *CALCULO 2 RESTA
           DISPLAY "DONDE, C ES:" WKS-C " A ES: " WKS-A " B ES: " WKS-B
           SUBTRACT WKS-C FROM WKS-A WKS-B
           DISPLAY "Y EL RESULTADO ES: A " WKS-A " DE B : " WKS-B
           DISPLAY "DESPUES:" WKS-REGISTRO
           DISPLAY "   "

      *REGRESAR EL BACKUP Y REPETIR EL PROCESO PARA OPERACION3
           MOVE WKS-REGISTRO-BACKUP TO WKS-REGISTRO
           DISPLAY "ANTES:" WKS-REGISTRO
           DISPLAY "OPERACION 3:MULTIPLICACION-MULTIPLY A BY B GIVING E"
      *CALCULO 3 MULTIPLICACION
           MULTIPLY WKS-A BY WKS-B GIVING WKS-E
           DISPLAY "DONDE, A ES:" WKS-A " B ES: " WKS-B
           DISPLAY "Y EL RESULTADO ES:" WKS-E
           DISPLAY "DESPUES:" WKS-REGISTRO
           DISPLAY "   "

      *REGRESAR EL BACKUP Y REPETIR EL PROCESO PARA OPERACION3
           MOVE WKS-REGISTRO-BACKUP TO WKS-REGISTRO
           DISPLAY "ANTES:" WKS-REGISTRO
           DISPLAY "OPERACION 4:DIVISIONN-DIVIDE C INTO A GIVING D"
      * CALCULO 4 DIVISION NORMAL-DIVISOR  BY DIVIDENDO
           DIVIDE WKS-C INTO WKS-A GIVING WKS-D
           DISPLAY "DONDE, C ES: " WKS-C " A ES: " WKS-A
           DISPLAY "Y EL RESULTADO ES: " WKS-D
           DISPLAY "DESPUES:" WKS-REGISTRO
           DISPLAY "   "

      *REGRESAR EL BACKUP Y REPETIR EL PROCESO PARA OPERACION3
           MOVE WKS-REGISTRO-BACKUP TO WKS-REGISTRO
           DISPLAY "ANTES:" WKS-REGISTRO
           DISPLAY "OPERACION 5:DIVISIONR-DIVIDE A BY C GIVING D"
      *CALCULO 5 DIVISION CON RESIDUO-DIVIDENDO BY DIVISOR
           DIVIDE WKS-A BY WKS-C GIVING WKS-D REMAINDER WKS-E
           DISPLAY "DONDE, A ES: " WKS-A " C ES: " WKS-C
           DISPLAY "Y EL RESULTADO ES: D= " WKS-D " E= " WKS-E
           DISPLAY "DESPUES:" WKS-REGISTRO
           STOP RUN.
       00-OPERACIONES-E. EXIT.